#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/naga-paritala/terraform-samples/runs/run-PGBLWxVqfNv1mxz3

Waiting for the plan to start...

Terraform v0.14.0
Initializing plugins and modules...
2023/06/17 19:29:32 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2023/06/17 19:29:32 [INFO] Terraform version: 0.14.0  
2023/06/17 19:29:32 [INFO] Go runtime version: go1.15.2
2023/06/17 19:29:32 [INFO] CLI args: []string{"/home/tfc-agent/.tfc-agent/component/terraform/runs/run-PGBLWxVqfNv1mxz3/bin/terraform", "plan", "-out=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-PGBLWxVqfNv1mxz3/config/terraform.tfplan", "-var-file=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-PGBLWxVqfNv1mxz3/terraform.tfvars", "-detailed-exitcode", "-lock=false"}
2023/06/17 19:29:32 Loading CLI configuration from /home/tfc-agent/.tfc-agent/component/terraform/runs/run-PGBLWxVqfNv1mxz3/.terraformrc
2023/06/17 19:29:32 [INFO] CLI command args: []string{"plan", "-out=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-PGBLWxVqfNv1mxz3/config/terraform.tfplan", "-var-file=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-PGBLWxVqfNv1mxz3/terraform.tfvars", "-detailed-exitcode", "-lock=false"}
2023/06/17 19:29:32 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2023/06/17 19:29:33 [INFO] Failed to read plugin lock file .terraform/plugins/linux_amd64/lock.json: open .terraform/plugins/linux_amd64/lock.json: no such file or directory
2023/06/17 19:29:33 [INFO] backend/local: starting Plan operation
2023-06-17T19:29:34.110Z [INFO]  plugin: configuring client automatic mTLS
2023-06-17T19:29:34.417Z [INFO]  plugin.terraform-provider-aws_v5.4.0_x5: configuring server automatic mTLS: timestamp=2023-06-17T19:29:34.417Z
2023-06-17T19:29:34.792Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2023-06-17T19:29:34.794Z [INFO]  plugin: configuring client automatic mTLS
2023-06-17T19:29:34.822Z [INFO]  plugin.terraform-provider-null_v3.2.1_x5: configuring server automatic mTLS: timestamp=2023-06-17T19:29:34.822Z
2023-06-17T19:29:34.872Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2023-06-17T19:29:34.874Z [INFO]  plugin: configuring client automatic mTLS
2023-06-17T19:29:34.906Z [INFO]  plugin.terraform-provider-random_v3.5.1_x5: configuring server automatic mTLS: timestamp=2023-06-17T19:29:34.905Z
2023-06-17T19:29:34.951Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2023/06/17 19:29:34 [INFO] terraform: building graph: GraphTypeValidate
2023-06-17T19:29:34.966Z [INFO]  plugin: configuring client automatic mTLS
2023-06-17T19:29:35.266Z [INFO]  plugin.terraform-provider-aws_v5.4.0_x5: configuring server automatic mTLS: timestamp=2023-06-17T19:29:35.265Z
2023-06-17T19:29:35.689Z [WARN]  plugin.terraform-provider-aws_v5.4.0_x5: Response contains warning diagnostic: diagnostic_detail="use domain attribute instead" diagnostic_severity=WARNING diagnostic_summary="Argument is deprecated" tf_req_id=2b3ebf1a-6276-1828-22a7-3defd52f2a23 tf_resource_type=aws_eip @caller=github.com/hashicorp/terraform-plugin-go@v0.15.0/tfprotov5/internal/diag/diagnostics.go:57 @module=sdk.proto diagnostic_attribute=AttributeName("vpc") tf_rpc=ValidateResourceTypeConfig tf_proto_version=5.3 tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-17T19:29:35.687Z
2023-06-17T19:29:35.689Z [WARN]  plugin.terraform-provider-aws_v5.4.0_x5: Response contains warning diagnostic: @module=sdk.proto diagnostic_attribute=AttributeName("vpc") diagnostic_summary="Argument is deprecated" tf_proto_version=5.3 tf_req_id=c1cf0f3c-47b7-7c88-49f3-0bb6c9f8364f tf_resource_type=aws_eip @caller=github.com/hashicorp/terraform-plugin-go@v0.15.0/tfprotov5/internal/diag/diagnostics.go:57 diagnostic_detail="use domain attribute instead" diagnostic_severity=WARNING tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ValidateResourceTypeConfig timestamp=2023-06-17T19:29:35.688Z
2023-06-17T19:29:35.698Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2023/06/17 19:29:35 [INFO] backend/local: plan calling Plan
2023/06/17 19:29:35 [INFO] terraform: building graph: GraphTypePlan
2023-06-17T19:29:35.715Z [INFO]  plugin: configuring client automatic mTLS
2023-06-17T19:29:36.022Z [INFO]  plugin.terraform-provider-aws_v5.4.0_x5: configuring server automatic mTLS: timestamp=2023-06-17T19:29:36.022Z
2023-06-17T19:29:36.346Z [INFO]  plugin.terraform-provider-aws_v5.4.0_x5: Retrieved credentials: tf_aws.credentials_source=EnvConfigCredentials tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=417be1ac-a23c-89be-3529-1e8cc427fd66 tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:33 @module=aws.aws-base timestamp=2023-06-17T19:29:36.345Z
2023-06-17T19:29:36.363Z [INFO]  plugin.terraform-provider-aws_v5.4.0_x5: Retrieved caller identity from STS: @module=aws.aws-base tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=417be1ac-a23c-89be-3529-1e8cc427fd66 tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:33 timestamp=2023-06-17T19:29:36.363Z
2023-06-17T19:29:36.367Z [INFO]  plugin.terraform-provider-aws_v5.4.0_x5: Retrieved caller identity from STS: tf_req_id=417be1ac-a23c-89be-3529-1e8cc427fd66 @module=aws.aws-base tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:33 timestamp=2023-06-17T19:29:36.367Z
2023/06/17 19:29:36 [INFO] ReferenceTransformer: reference not found: "var.cidr_block"
2023/06/17 19:29:36 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_iam_role.eks_node_group_role, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .force_detach_policies: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .max_session_duration: planned value cty.NumberIntVal(3600) does not match config value cty.NullVal(cty.Number)
      - .path: planned value cty.StringVal("/") does not match config value cty.NullVal(cty.String)
      - .inline_policy: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2023/06/17 19:29:36 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_iam_role.eks_role, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .force_detach_policies: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .max_session_duration: planned value cty.NumberIntVal(3600) does not match config value cty.NullVal(cty.Number)
      - .assume_role_policy: planned value cty.StringVal("{\"Statement\":[{\"Action\":\"sts:AssumeRole\",\"Effect\":\"Allow\",\"Principal\":{\"Service\":\"eks.amazonaws.com\"}}],\"Version\":\"2012-10-17\"}") does not match config value cty.StringVal("{\n  \"Version\": \"2012-10-17\",\n  \"Statement\": [\n    {\n      \"Effect\": \"Allow\",\n      \"Principal\": {\n        \"Service\": \"eks.amazonaws.com\"\n      },\n      \"Action\": \"sts:AssumeRole\"\n    }\n  ]\n}\n")
      - .path: planned value cty.StringVal("/") does not match config value cty.NullVal(cty.String)
      - .inline_policy: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2023/06/17 19:29:36 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.vpc.aws_vpc.main_vpc, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .instance_tenancy: planned value cty.StringVal("default") does not match config value cty.NullVal(cty.String)
      - .enable_dns_support: planned value cty.True does not match config value cty.NullVal(cty.Bool)
2023/06/17 19:29:36 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2023/06/17 19:29:36 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2023/06/17 19:29:36 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2023-06-17T19:29:36.405Z [WARN]  plugin.terraform-provider-aws_v5.4.0_x5: Response contains warning diagnostic: diagnostic_summary="Argument is deprecated" tf_proto_version=5.3 tf_resource_type=aws_eip @module=sdk.proto diagnostic_detail="use domain attribute instead" diagnostic_severity=WARNING tf_rpc=ValidateResourceTypeConfig diagnostic_attribute=AttributeName("vpc") @caller=github.com/hashicorp/terraform-plugin-go@v0.15.0/tfprotov5/internal/diag/diagnostics.go:57 tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=b9674322-7f64-9f68-bccb-4c6fa1e84a49 timestamp=2023-06-17T19:29:36.404Z
2023/06/17 19:29:36 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2023/06/17 19:29:36 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2023/06/17 19:29:36 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.vpc.aws_subnet.private_db, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .enable_dns64: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .assign_ipv6_address_on_creation: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .enable_resource_name_dns_a_record_on_launch: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .enable_resource_name_dns_aaaa_record_on_launch: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .ipv6_native: planned value cty.False does not match config value cty.NullVal(cty.Bool)
2023/06/17 19:29:36 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2023/06/17 19:29:36 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.vpc.aws_subnet.public_fe, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .enable_dns64: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .assign_ipv6_address_on_creation: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .enable_resource_name_dns_a_record_on_launch: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .enable_resource_name_dns_aaaa_record_on_launch: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .ipv6_native: planned value cty.False does not match config value cty.NullVal(cty.Bool)
2023-06-17T19:29:36.415Z [WARN]  plugin.terraform-provider-aws_v5.4.0_x5: Response contains warning diagnostic: @caller=github.com/hashicorp/terraform-plugin-go@v0.15.0/tfprotov5/internal/diag/diagnostics.go:57 tf_req_id=24cd9a0c-956c-00d1-a152-8ac8b6f46a38 diagnostic_attribute=AttributeName("vpc") diagnostic_severity=WARNING tf_proto_version=5.3 tf_provider_addr=registry.terraform.io/hashicorp/aws @module=sdk.proto diagnostic_detail="use domain attribute instead" diagnostic_summary="Argument is deprecated" tf_resource_type=aws_eip tf_rpc=ValidateResourceTypeConfig timestamp=2023-06-17T19:29:36.411Z
2023/06/17 19:29:36 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.vpc.aws_subnet.private_be, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .enable_dns64: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .assign_ipv6_address_on_creation: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .enable_resource_name_dns_a_record_on_launch: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .enable_resource_name_dns_aaaa_record_on_launch: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .ipv6_native: planned value cty.False does not match config value cty.NullVal(cty.Bool)
2023/06/17 19:29:36 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.vpc.aws_nat_gateway.nat_gw_db, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .connectivity_type: planned value cty.StringVal("public") does not match config value cty.NullVal(cty.String)
2023/06/17 19:29:36 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2023/06/17 19:29:36 [INFO] ReferenceTransformer: reference not found: "aws_iam_role_policy_attachment.eks_role-AmazonEKSClusterPolicy"
2023/06/17 19:29:36 [INFO] ReferenceTransformer: reference not found: "aws_iam_role_policy_attachment.eks_role-AmazonEKSVPCResourceController"
2023/06/17 19:29:36 [INFO] ReferenceTransformer: reference not found: "var.subnet_fe_id"
2023/06/17 19:29:36 [INFO] ReferenceTransformer: reference not found: "var.subnet_be_id"
2023/06/17 19:29:36 [INFO] ReferenceTransformer: reference not found: "var.subnet_db_id"
2023/06/17 19:29:36 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.vpc.aws_nat_gateway.nat_gw_be, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .connectivity_type: planned value cty.StringVal("public") does not match config value cty.NullVal(cty.String)
2023/06/17 19:29:36 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_eks_cluster.eks_cluster, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .vpc_config[0].endpoint_public_access: planned value cty.True does not match config value cty.NullVal(cty.Bool)
      - .vpc_config[0].subnet_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String), cty.UnknownVal(cty.String), cty.UnknownVal(cty.String)})
      - .vpc_config[0].endpoint_private_access: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .kubernetes_network_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2023/06/17 19:29:36 [INFO] ReferenceTransformer: reference not found: "aws_iam_role_policy_attachment.eks-node-group-role-AmazonEKSWorkerNodePolicy"
2023/06/17 19:29:36 [INFO] ReferenceTransformer: reference not found: "aws_iam_role_policy_attachment.eks-node-group-role-AmazonEKS_CNI_Policy"
2023/06/17 19:29:36 [INFO] ReferenceTransformer: reference not found: "aws_iam_role_policy_attachment.eks-node-group-role-AmazonEC2ContainerRegistryReadOnly"
2023/06/17 19:29:36 [INFO] ReferenceTransformer: reference not found: "var.subnet_fe_id"
2023/06/17 19:29:36 [INFO] ReferenceTransformer: reference not found: "var.subnet_be_id"
2023/06/17 19:29:36 [INFO] ReferenceTransformer: reference not found: "var.subnet_db_id"
2023/06/17 19:29:36 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_eks_node_group.eks_node_group, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .subnet_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String), cty.UnknownVal(cty.String), cty.UnknownVal(cty.String)})
      - .update_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2023-06-17T19:29:36.438Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2023/06/17 19:29:36 [INFO] backend/local: plan operation completed
2023/06/17 19:29:36 [INFO] backend/local: writing plan output to: /home/tfc-agent/.tfc-agent/component/terraform/runs/run-PGBLWxVqfNv1mxz3/config/terraform.tfplan

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.aws_eks_cluster.eks_cluster will be created
  + resource "aws_eks_cluster" "eks_cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "eks_cluster"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = (known after apply)

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.eks_node_group will be created
  + resource "aws_eks_node_group" "eks_node_group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "eks_cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + node_group_name        = "eks_node_group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # module.eks.aws_iam_role.eks_node_group_role will be created
  + resource "aws_iam_role" "eks_node_group_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-node-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role.eks_role will be created
  + resource "aws_iam_role" "eks_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role_policy_attachment.eks-node-group-role-AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "eks-node-group-role-AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-node-group-role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks-node-group-role-AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "eks-node-group-role-AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-node-group-role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks-node-group-role-AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "eks-node-group-role-AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-node-group-role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_role-AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "eks_role-AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-cluster-role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_role-AmazonEKSVPCResourceController will be created
  + resource "aws_iam_role_policy_attachment" "eks_role-AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "eks-cluster-role"
    }

  # module.vpc.aws_eip.nat_be will be created
  + resource "aws_eip" "nat_be" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # module.vpc.aws_eip.nat_db will be created
  + resource "aws_eip" "nat_db" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # module.vpc.aws_internet_gateway.main_internet_gateway will be created
  + resource "aws_internet_gateway" "main_internet_gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags_all = (known after apply)
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.nat_gw_be will be created
  + resource "aws_nat_gateway" "nat_gw_be" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.vpc.aws_nat_gateway.nat_gw_db will be created
  + resource "aws_nat_gateway" "nat_gw_db" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.vpc.aws_subnet.private_be will be created
  + resource "aws_subnet" "private_be" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.100.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public"
        }
      + tags_all                                       = {
          + "Name" = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private_db will be created
  + resource "aws_subnet" "private_db" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.200.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public"
        }
      + tags_all                                       = {
          + "Name" = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public_fe will be created
  + resource "aws_subnet" "public_fe" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public"
        }
      + tags_all                                       = {
          + "Name" = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.main_vpc will be created
  + resource "aws_vpc" "main_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = (known after apply)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + eks_role_arn                          = (known after apply)
  + endpoint                              = (known after apply)
  + kubeconfig-certificate-authority-data = (known after apply)
  + vpc_id                                = (known after apply)

Warning: Argument is deprecated

  on vpc/eip_nat_be.tf line 2, in resource "aws_eip" "nat_be":
   2:   vpc      = true

use domain attribute instead

(and one more similar warning elsewhere)


------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 6 estimated
           $0.0/mo +$0.0
```
</details>
*Pusher: @malliparitala, Action: `pull_request`*